ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_plxs.c
/***************************************************************************//**
* \file cy_ble_plxs.c
* \version 2.0
*
* \brief
*  This file contains the source code for the Pulse Oximeter Service of the BLE Component.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#include "cy_ble_event_handler.h"

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#if (CY_BLE_MODE_PROFILE && defined(CY_BLE_PLXS))

static cy_ble_callback_t Cy_BLE_PLXS_ApplCallback;

#ifdef CY_BLE_PLXS_SERVER
/* PLXS Server flags */
uint32_t cy_ble_plxssFlag;

/* The internal storage for the last request handle to check response for server */
static cy_ble_gatt_db_attr_handle_t cy_ble_plxssReqHandle;
#endif /* CY_BLE_PLXS_SERVER */

#ifdef CY_BLE_PLXS_CLIENT
/* Server's PLX Service characteristics GATT DB handles structure */
cy_stc_ble_plxsc_t cy_ble_plxsc[CY_BLE_CONFIG_GATTC_COUNT];

/* Internal storage for last request handle to check the response */
static cy_ble_gatt_db_attr_handle_t cy_ble_plxscReqHandle[CY_BLE_CONFIG_GATTC_COUNT];

/* RACP Procedure Timeout TIMER setting */
static cy_stc_ble_timer_info_t cy_ble_plxscRacpTimeout[CY_BLE_CONFIG_GATTC_COUNT];

/* PLXS Client flags */
uint32_t cy_ble_plxscFlag[CY_BLE_CONFIG_GATTC_COUNT];
#endif /* CY_BLE_PLXS_CLIENT */

/* The pointer on global BLE PLXS Config structure */
cy_stc_ble_plxs_config_t *cy_ble_plxsConfigPtr = NULL;

/***************************************
* Private Function Prototypes
***************************************/
#ifdef CY_BLE_PLXS_SERVER
static void Cy_BLE_PLXSS_ConfirmationEventHandler(const cy_stc_ble_conn_handle_t *eventParam);
static cy_en_ble_gatt_err_code_t Cy_BLE_PLXSS_WriteEventHandler(cy_stc_ble_gatts_write_cmd_req_param_t *eventParam);
#endif /* CY_BLE_PLXS_SERVER */

#ifdef CY_BLE_PLXS_CLIENT
static void Cy_BLE_PLXSC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo);
static void Cy_BLE_PLXSC_DiscoverCharDescriptorsEventHandler(cy_stc_ble_disc_descr_info_t *discDescrInfo);
static void Cy_BLE_PLXSC_GetCharRange(cy_stc_ble_disc_range_info_t *charRangeInfo);
static void Cy_BLE_PLXSC_NotificationEventHandler(cy_stc_ble_gattc_handle_value_ntf_param_t *eventParam);
static void Cy_BLE_PLXSC_IndicationEventHandler(cy_stc_ble_gattc_handle_value_ind_param_t *eventParam);
static void Cy_BLE_PLXSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam);
static void Cy_BLE_PLXSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam);
static void Cy_BLE_PLXSC_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam);
static void Cy_BLE_PLXSC_TimeOutEventHandler(const cy_stc_ble_timeout_param_t *eventParam);
#endif /* CY_BLE_PLXS_CLIENT */
static cy_en_ble_gatt_err_code_t Cy_BLE_PLXS_EventHandler(uint32_t eventCode, void *eventParam);


/******************************************************************************
* Function Name: Cy_BLE_PLXS_Init
***************************************************************************//**
*
*  Initializes the profile internals.
*
*  \param config: Configuration structure for the Pulse Oximeter Service.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_PARAMETER          | On specifying NULL as input parameter
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED   | Buffer overflow in the registration callback.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_PLXS_Init(cy_stc_ble_plxs_config_t *config)
{
    cy_en_ble_api_result_t apiResult;

    if(config == NULL)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        /* Registers a pointer to config structure */
        cy_ble_plxsConfigPtr = config;

        /* Registers Event Handler for the PLXS Service */
        apiResult = Cy_BLE_RegisterServiceEventHandler(&Cy_BLE_PLXS_EventHandler);

        /* Registers a callback function via config structure */
        if(cy_ble_plxsConfigPtr->callbackFunc != NULL)
        {
            Cy_BLE_PLXS_ApplCallback = cy_ble_plxsConfigPtr->callbackFunc;
        }

        #ifdef CY_BLE_PLXS_SERVER
        cy_ble_plxssFlag = 0u;
        cy_ble_plxssReqHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        #endif /* CY_BLE_PLXS_SERVER */

        #ifdef CY_BLE_PLXS_CLIENT
        {
            uint32_t idx;
            for(idx = 0u; idx < CY_BLE_CONFIG_GATTC_COUNT; idx++)
            {
                if(cy_ble_serverInfo[idx][CY_BLE_SRVI_PLXS].range.startHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                {
                    (void)memset(&cy_ble_plxsc[idx], 0, sizeof(cy_stc_ble_plxsc_t));

                    /* initialize UUID */
                    cy_ble_serverInfo[idx][CY_BLE_SRVI_PLXS].uuid = CY_BLE_UUID_PULSE_OXIMETER_SERVICE;
                }
                cy_ble_plxscReqHandle[idx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                cy_ble_plxscRacpTimeout[idx].timeout = CY_BLE_PLXS_RACP_PROCEDURE_TIMEOUT;
                cy_ble_plxscFlag[idx] = 0u;
            }
        }
        #endif /* CY_BLE_PLXS_CLIENT */
    }

    return(apiResult);
}


/******************************************************************************
* Function Name: Cy_BLE_PLXS_RegisterAttrCallback
***************************************************************************//**
*
*  Registers a callback function for service-specific attribute operations.
*  Service specific write requests from peer device will not be handled with
*  unregistered callback function.
*
*  \param callbackFunc:  An application layer event callback function to receive
*                        events from the BLE Component. The definition of
*                        cy_ble_callback_t for PLX Service is:
*                    typedef void (* cy_ble_callback_t) (uint32_t eventCode,
*                                                        void *eventParam)
*                    * eventCode indicates the event that triggered this
*                      callback.
*                    * eventParam contains the parameters corresponding to the
*                      current event.
*
* \sideeffect The *eventParams in the callback function should not be used
*                by the application once the callback function execution is
*                finished. Otherwise this data may become corrupted.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes:
*
*   Error Codes                             | Description
*   ------------                            | -----------
*   CY_BLE_SUCCESS                          | The function completed successfully.
*   CY_BLE_ERROR_INVALID_OPERATION          | This operation is not permitted
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_PLXS_RegisterAttrCallback(cy_ble_callback_t callbackFunc)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    
