ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_plxs.c
                    locCharValue.value = NULL;
                    if(gattErr == CY_BLE_GATT_ERR_NONE)
                    {
                        switch(locCharValue.charIndex)
                        {
                            /* INDICATION */
                            case CY_BLE_PLXS_SCMT:
                            case CY_BLE_PLXS_RACP:
                                if(CY_BLE_IS_INDICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                                {
                                    Cy_BLE_PLXS_ApplCallback((uint32_t)CY_BLE_EVT_PLXSS_INDICATION_ENABLED,
                                                             &locCharValue);
                                }
                                else
                                {
                                    Cy_BLE_PLXS_ApplCallback((uint32_t)CY_BLE_EVT_PLXSS_INDICATION_DISABLED,
                                                             &locCharValue);
                                }
                                break;

                            /* NOTIFICATION */
                            case CY_BLE_PLXS_CTMT:
                                if(CY_BLE_IS_NOTIFICATION_ENABLED_IN_PTR(eventParam->handleValPair.value.val))
                                {
                                    Cy_BLE_PLXS_ApplCallback((uint32_t)CY_BLE_EVT_PLXSS_NOTIFICATION_ENABLED,
                                                             &locCharValue);
                                }
                                else
                                {
                                    Cy_BLE_PLXS_ApplCallback((uint32_t)CY_BLE_EVT_PLXSS_NOTIFICATION_DISABLED,
                                                             &locCharValue);
                                }
                                break;

                            default:
                                break;
                        }
                    }
                #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && \
                    (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))

                    /* Set flag to store bonding data to flash */
                    if(cy_ble_peerBonding[eventParam->connHandle.attId] == CY_BLE_GAP_BONDING)
                    {
                        cy_ble_pendingFlashWrite |= CY_BLE_PENDING_CCCD_FLASH_WRITE_BIT;
                    }
                #endif /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */

                    cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                    break;
                }
            }
        }
    }

    if(gattErr)
    {
        /* If we have gattErr, so release flag CY_BLE_PLXS_FLAG_PROCESS */
        cy_ble_plxssFlag &= (uint8_t) ~CY_BLE_PLXS_FLAG_PROCESS;
    }

    return(gattErr);
}

#endif /* CY_BLE_PLXS_SERVER */

#ifdef CY_BLE_PLXS_CLIENT


/******************************************************************************
* Function Name: Cy_BLE_PLXSC_SetCharacteristicValue
***************************************************************************//**
*
*  This function is used to write the characteristic (which is identified by
*  charIndex) value attribute in the server. As a result a Write Request is
*  sent to the GATT Server and on successful execution of the request on the
*  Server side the CY_BLE_EVT_PLXSS_WRITE_CHAR events is generated.
*  On successful request execution on the Server side the Write Response is
*  sent to the Client.
*
*  \param connHandle: The connection handle.
*  \param charIndex: The index of a service characteristic.
*  \param attrSize: The size of the characteristic value attribute.
*  \param *attrValue: The pointer to the characteristic value data that should be
*               sent to the server device.
*
* \return
*  Return value is of type cy_en_ble_api_result_t.
*  * CY_BLE_SUCCESS - The request was sent successfully
*  * CY_BLE_ERROR_INVALID_PARAMETER - Validation of the input parameters failed
*  * CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED - Memory allocation failed
*  * CY_BLE_ERROR_INVALID_STATE - Connection with the server is not established
*  * CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE - The peer device doesn't have
*                                               the particular characteristic
*  * CY_BLE_ERROR_INVALID_OPERATION - Operation is invalid for this
*                                     characteristic
*
* \events
*  In case of successful execution (return value = CY_BLE_SUCCESS)
*  the next events can appear: \n
*   If the PLXS service-specific callback is registered
*      (with Cy_BLE_PLXS_RegisterAttrCallback):
*  * CY_BLE_EVT_PLXSC_WRITE_CHAR_RESPONSE - in case if the requested attribute is
*                                successfully written on the peer device,
*                                the details (char index, etc.) are
*                                provided with event parameter structure
*                                of type cy_stc_ble_plxs_char_value_t.
*  .
*   Otherwise (if the PLXS service-specific callback is not registered):
*  * CY_BLE_EVT_GATTC_WRITE_RSP - in case if the requested attribute is
*                                successfully written on the peer device.
*  * CY_BLE_EVT_GATTC_ERROR_RSP - in case if there is some trouble with the
*                                requested attribute on the peer device,
*                                the details are provided with event parameters
*                                structure (cy_stc_ble_gatt_err_param_t).
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_PLXSC_SetCharacteristicValue(cy_stc_ble_conn_handle_t connHandle,
                                                           cy_en_ble_plxs_char_index_t charIndex,
                                                           uint8_t attrSize,
                                                           uint8_t * attrValue)
{
    cy_en_ble_api_result_t apiResult;
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

    /* Check the parameters */
    if(Cy_BLE_GetConnectionState(connHandle) != CY_BLE_CONN_STATE_CLIENT_DISCOVERED)
    {
        apiResult = CY_BLE_ERROR_INVALID_STATE;
    }
    else if((charIndex >= CY_BLE_PLXS_CHAR_COUNT) || (discIdx >= CY_BLE_CONFIG_GATTC_COUNT))
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else if(cy_ble_plxsc[discIdx].charInfo[charIndex].valueHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
    {
        apiResult = CY_BLE_ERROR_GATT_DB_INVALID_ATTR_HANDLE;
    }
    else if((CY_BLE_CHAR_PROP_WRITE & cy_ble_plxsc[discIdx].charInfo[charIndex].properties) == 0u)
    {
        apiResult = CY_BLE_ERROR_INVALID_OPERATION;
    }
    else
    {
        cy_stc_ble_gattc_write_req_t writeReqParam =
        {
            .handleValPair.attrHandle = cy_ble_plxsc[discIdx].charInfo[charIndex].valueHandle,
            .handleValPair.value.val  = attrValue,
            .handleValPair.value.len  = attrSize,
            .connHandle               = connHandle,
        };
        apiResult = Cy_BLE_GATTC_WriteCharacteristicValue(&writeReqParam);
        if(apiResult == CY_BLE_SUCCESS)
        {
            cy_ble_plxscReqHandle[discIdx] = cy_ble_plxsc[discIdx].charInfo[charIndex].valueHandle;
        }

        if(charIndex == CY_BLE_PLXS_RACP)
        {
            /* Start RACP procedure. It will ends when the Collector sends a confirmation to acknowledge the RACP
             * indication sent by the Sensor. A procedure is considered to have timed out if a RACP indication
             * (or PLX Spot-check Measurement characteristic indication) is not received within the ATT transaction timeout,
             * defined as 5 seconds. CY_BLE_EVT_PLXSC_TIMEOUT event indicate about CP procedure timeout.
             */
            apiResult = Cy_BLE_StartTimer(&cy_ble_plxscRacpTimeout[discIdx]);
            if(apiResult == CY_BLE_SUCCESS)
            {
                cy_ble_plxscFlag[discIdx] |= CY_BLE_PLXS_FLAG_PROCESS;
            }
        }
    }

    return(apiResult);
}


