ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_plxs.c
            if((cy_ble_plxscFlag[discIdx] & CY_BLE_PLXS_FLAG_PROCESS) != 0u)
            {
                /* Restart RACP timeout timer during RACP procedure(Report stored records)*/
                (void)Cy_BLE_StopTimer(&cy_ble_plxscRacpTimeout[discIdx]);
                (void)Cy_BLE_StartTimer(&cy_ble_plxscRacpTimeout[discIdx]);
            }
        }
        else if(cy_ble_plxsc[discIdx].charInfo[CY_BLE_PLXS_RACP].valueHandle == eventParam->handleValPair.attrHandle)
        {
            locCharValue.charIndex = CY_BLE_PLXS_RACP;
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;

            /* End of RACP procedure, so stop RACP timeout timer */
            (void)Cy_BLE_StopTimer(&cy_ble_plxscRacpTimeout[discIdx]);
            cy_ble_plxscFlag[discIdx] &= ~CY_BLE_PLXS_FLAG_PROCESS;
        }
        else
        {
            /* PLXS Service doesn't support any other indications */
        }

        if((cy_ble_eventHandlerFlag & CY_BLE_CALLBACK) == 0u)
        {
            locCharValue.value = &eventParam->handleValPair.value;
            Cy_BLE_PLXS_ApplCallback((uint32_t)CY_BLE_EVT_PLXSC_INDICATION, &locCharValue);
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_PLXSC_ReadResponseEventHandler
***************************************************************************//**
*
*  Handles the Read Response Event.
*
*  \param *eventParam: The pointer to the data structure.
*
******************************************************************************/
static void Cy_BLE_PLXSC_ReadResponseEventHandler(cy_stc_ble_gattc_read_rsp_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_PLXS_ApplCallback != NULL) &&
       (cy_ble_plxscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        cy_en_ble_plxs_char_index_t charIdx;
        uint32_t fFlag = 0u;

        for(charIdx = (cy_en_ble_plxs_char_index_t)0u; (charIdx < CY_BLE_PLXS_CHAR_COUNT) && (fFlag == 0u); charIdx++)
        {
            if(cy_ble_plxsc[discIdx].charInfo[charIdx].valueHandle == cy_ble_plxscReqHandle[discIdx])
            {
                cy_stc_ble_plxs_char_value_t locCharValue =
                {
                    .connHandle = eventParam->connHandle,
                    .charIndex  = charIdx,
                    .value      = &eventParam->value
                };
                cy_ble_plxscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                Cy_BLE_PLXS_ApplCallback((uint32_t)CY_BLE_EVT_PLXSC_READ_CHAR_RESPONSE, &locCharValue);
                fFlag = 1u; /* instead of break */
            }
            else if(cy_ble_plxsc[discIdx].charInfo[charIdx].descrHandle[CY_BLE_PLXS_CCCD] == cy_ble_plxscReqHandle[discIdx])
            {
                cy_stc_ble_plxs_descr_value_t locDescrValue =
                {
                    .connHandle = eventParam->connHandle,
                    .charIndex  = charIdx,
                    .descrIndex = CY_BLE_PLXS_CCCD,
                    .value      = &eventParam->value
                };
                cy_ble_plxscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                Cy_BLE_PLXS_ApplCallback((uint32_t)CY_BLE_EVT_PLXSC_READ_DESCR_RESPONSE, &locDescrValue);
                fFlag = 1u; /* instead of break */
            }
            else
            {
                /* nothing else */
            }
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_PLXSC_WriteResponseEventHandler
***************************************************************************//**
*
*  Handles the Write Response Event.
*
*  \param *eventParam: The pointer to a data structure specified by the event.
*
******************************************************************************/
static void Cy_BLE_PLXSC_WriteResponseEventHandler(const cy_stc_ble_conn_handle_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(*eventParam);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (Cy_BLE_PLXS_ApplCallback != NULL) &&
       (cy_ble_plxscReqHandle[discIdx] != CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
    {
        cy_en_ble_plxs_char_index_t charIdx;
        uint32_t fFlag = 0u;

        for(charIdx = (cy_en_ble_plxs_char_index_t)0u; (charIdx < CY_BLE_PLXS_CHAR_COUNT) && (fFlag == 0u); charIdx++)
        {
            if(cy_ble_plxsc[discIdx].charInfo[charIdx].valueHandle == cy_ble_plxscReqHandle[discIdx])
            {
                cy_stc_ble_plxs_char_value_t locCharValue =
                {
                    .connHandle = *eventParam,
                    .charIndex  = charIdx,
                    .value      = NULL
                };
                cy_ble_plxscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                Cy_BLE_PLXS_ApplCallback((uint32_t)CY_BLE_EVT_PLXSC_WRITE_CHAR_RESPONSE, &locCharValue);
                fFlag = 1u; /* instead of break */
            }
            else if(cy_ble_plxsc[discIdx].charInfo[charIdx].descrHandle[CY_BLE_PLXS_CCCD] ==
                    cy_ble_plxscReqHandle[discIdx])
            {
                cy_stc_ble_plxs_descr_value_t locDescrValue =
                {
                    .connHandle = *eventParam,
                    .charIndex  = charIdx,
                    .descrIndex = CY_BLE_PLXS_CCCD,
                    .value      = NULL
                };
                cy_ble_plxscReqHandle[discIdx] = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                Cy_BLE_PLXS_ApplCallback((uint32_t)CY_BLE_EVT_PLXSC_WRITE_DESCR_RESPONSE, &locDescrValue);
                fFlag = 1u; /* instead of break */
            }
            else
            {
                /* nothing else */
            }
        }
    }
}


